unit SMsg;

interface

const

    //Client Message Format List for System S
    SF_A110 = '하십시오.';
    SF_A120 = '$S가능한 $S가(이) 없습니다.';
    SF_A130 = '$S할 $S을(를) $S하십시요.';
    SF_A140 = '$S이(가) $S 할 수 없습니다.';
    SF_A150 = '$S은(는) $S여야 합니다.';
    SF_A160 = '$S가(이) $S이상 $S합니다.';
    SF_A170 = '$S할 $S을(를) $S하십시오.';


    //Noun List
    S_NF100   = '채취'         ;
    S_NF110   = '검사명'       ;
    S_NF111   = '검사항목'     ;
    S_NF112   = '검사항목수'   ;
    S_NF113   = '검사실'       ;
    S_NF120   = 'Excel'        ;
    S_NF130   = '항생제SET코드';
    S_NF131   = '항생제SET명'  ;
    S_NF132   = '항생제SET'    ;
    S_NF133   = '항생제'       ;
    S_NF140   = '코드'         ;
    S_NF150   = '조회조건'     ;
    S_NF160   = 'Length'       ;
    S_NF170   = '예문자료'     ;
    S_NF180   = '검체'         ;
    S_NF190   = '용기코드'     ;
    S_NF200   = '정상치'       ;
    S_NF210   = '결과보고'     ;
    S_NF220   = '감수성결과'   ;
    S_NF230   = '반응균'       ;
    S_NF240   = '대상'         ;
    S_NF241   = '대상기간'     ;
    S_NF250   = 'SET검사항목'  ;
    S_NF260   = '바코드출력기' ;
    S_NF270   = '작업항목 분류규칙';
    S_NF280   = '검체';
    S_NF290   = '이하';
    S_NF291   = '이상';
    S_NF292   = '이내';
    S_NF300   = 'TEXT  결과입력';
    S_NF310   = '특기사항';
    S_NF320   = '자체';
    S_NF330   = '누적';
    S_NF340   = '약어명';
    S_NF350   = '혈액명';
    S_NF360   = '헌혈자명';
    S_NF370   = '이상검사';
//    S_NF380   = '핵의학체외 검사';    
    S_NF380   = '미생물';
    S_NF390   = '초기화';
    S_NF400   = '현재결과';
    S_NF410   = '전체';
    S_NF420   = '검증횟수';
    S_NF430   = '숫자';
    S_NF440   = 'URINE VOLUME';
    S_NF450   = '검증결과';

    

    SF_N010 = '$S을 $S로 바꾸시겠습니까?';
    SF_N020 = '$S 결과 $S이 $S자 이상 $S 할 수 없습니다.';
    SF_N030 = '$S한 $S이(가) $S와(과) $S하지 않습니다.';
    SF_N040 = '$S할 $S을(를) $S로 선택하십시요.';
    SF_N050 = '$S이 $S할 수 없습니다.';
    SF_N060 = '$S는 $S이하여야 합니다.';
    SF_N070 = '$S된 $S가 없습니다.';
    SF_N080 = '$S별 $S을 $S하시겠습니까?';
    SF_N090 = '$S가 포함되어 있습니다. $S을 다시 하시겠습니까?';
    SF_N100 = '$S가 없습니다.';


    SN010   = '검사결과';
    SN020   = 'ALL NEGATIVE ';
    SN030   = 'ALL CLEAR ';
    SN040   = 'Text';
    SN050   = '3000';
    SN060   = '채취';
    SN070   = '검체';
    SN080   = '항목분류규칙';
    SN090   = '작업항목';
    SN100   = '검사항목';
    SN110   = '10개이하';
    SN120   = '누적조회 검사항목';
    SN130   = '50개';
    SN140   = '환자';
    SN150   = '조회조건';
    SN160   = '접수번호';
    SN170   = 'WORKLIST';
    SN180   = '재검';
    SN190   = '검사실';
    SN200   = '최종확인 저장';
    SN210   = '검체스티커';
    SN220   = '결과보고';
    SN230   = '검사이력';
    SN240   = '핵체외검사';
    SN250   = '임상병리검사';
    SN260   = '채취검사';
    SN270   = '정상치';
    SN280   = 'ALL POSITIVE';
    SN290   = '먼저';



implementation

end.
